VPro/src/Catalogs/KeyResources/KeyResources.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KeyResources</name>
  <attributes>
    <name>Capacity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ResourceValue</name>
    <type>
      <types>CatalogRef.Teams</types>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>MultiplicityPlanning</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NotValid</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ControlIntervalsStepInDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseGraphInPlanning</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ControlLoadingOnlyInWorkTime</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseEmployeeGraph</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Calendar</name>
    <type>
      <types>CatalogRef.EmployeesCalendars</types>
    </type>
  </attributes>
  <attributes>
    <name>PictureFile</name>
    <type>
      <types>CatalogRef.KeyResourcesAttachedFiles</types>
    </type>
  </attributes>
</mdclass:Catalog>

VPro/src/InformationRegisters/EnterpriseResourcesKinds/EnterpriseResourcesKinds.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>EnterpriseResourcesKinds</name>
  <dimensions>
    <name>EnterpriseResourceKind</name>
    <type>
      <types>CatalogRef.EnterpriseResourcesKinds</types>
    </type>
  </dimensions>
  <dimensions>
    <name>EnterpriseResource</name>
    <type>
      <types>CatalogRef.KeyResources</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

VPro/src/Catalogs/KeyResources/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure BeforeWrite(Cancel)
	
	If Not ValueIsFilled(ResourceValue) Then
		ResourceValue = Undefined;	
	EndIf;
	
	If DataExchange.Load Then 
		Return;
	EndIf;
	
EndProcedure

Procedure OnWrite(Cancel)
	
	If DataExchange.Load Then 
		Return;
	EndIf;
	
	RecordSet = InformationRegisters.EnterpriseResourcesKinds.CreateRecordSet();
	RecordSet.Filter.EnterpriseResource.Set(Ref);
    RecordSet.Filter.EnterpriseResourceKind.Set(Catalogs.EnterpriseResourcesKinds.AllResources);
	
	NewRecord = RecordSet.Add();
	NewRecord.EnterpriseResourceKind = Catalogs.EnterpriseResourcesKinds.AllResources;
	NewRecord.EnterpriseResource = Ref;
	RecordSet.Write();
	
EndProcedure

Procedure OnCopy(CopiedObject)
	
	PictureFile = Catalogs.KeyResourcesAttachedFiles.EmptyRef();
	
EndProcedure // ПриКопировании()

Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	If ThisObject.UseEmployeeGraph Then
	
		CheckedAttributes.Add("ResourceValue");
	
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
